<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: yunwuxin <448901948@qq.com>
// +----------------------------------------------------------------------

return [
        'connector' => 'Database',   // 数据库驱动
        'expire'    => 60,           // 任务的过期时间，默认为60秒; 若要禁用，则设置为 null
        'default'   => 'default',    // 默认的队列名称
        'table'     => 'prefix_jobs',       // 存储消息的表名，不带前缀
        'dsn'       => [],
];